Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/dental_aural_and_optical_services/optometric_and_ophthalmic_services.html.txt.tmx
Source language: en
Languages: ga

source: Optometric and ophthalmic services
ga: Seirbhísí optaiméadracha agus oftalmacha

source: • Free optical and ophtalmic services
ga: • Seirbhísí optúla agus oftalmacha saor in aisce

source: Optometric or ophthalmology services provided through the public health service are provided free of charge to certain people by optometrists, dispensing opticians and ophtalmologists
ga: Cuireann optaiméadraithe, radharceolaithe dáilte agus oftailmeolaithe seirbhísí optaiméadracha agus oftalmacha ar fáil tríd an tseirbhís sláinte poiblí saor in aisce do dhaoine áirithe

source: While some of these health professionals are employed directly by the Health Service Executive (HSE), the majority of those providing these services do so on a contract basis
ga: Cé go bhfostaíonn Feidhmeannacht na Seirbhíse Sláinte (FSS) cuid de na gairmigh shláinte seo, déanann tromlach na ngairmeach siúd a sholáthraíonn na seirbhísí seo amhlaidh ar bhonn conartha

source: Optometrists (formerly known as ophtalmic opticians) examine your eyes to diagnose vision problems
ga: Déanann optaiméadraithe (tugadh radharceolaithe oftalmacha orthu seo roimhe seo) scrúdú ar do shúile chun fadhbanna amhairc a dhiagnóisiú

source: They use instruments and observation to examine eye health and to test your visual acuity, depth and colour perception and your ability to focus and co-ordinate your eyes
ga: Úsáideann siad ionstraimí agus breathnú chun scrúdú ar dhéanamh ar shláinte na súl agus chun do ghéire amhairc, doimhneacht agus aithint dathanna a thástáil mar aon le do chumas chun do shúile a dhíriú agus a chomhordú

source: Optometrists can also prescribe spectacles and contact lenses
ga: Tá optaiméadraithe in ann spéaclaí agus lionsaí tadhaill a ordú chomh maith

source: Dispensing opticians recommend and dispense spectacle frames, lenses, contact lenses, etc., having considered your prescription, your occupation, lifestyle, hobbies, etc
ga: Déanann radharceolaithe dáilte frámaí spéaclaí, lionsaí, lionsaí tadhaill etc. a mholadh, tar éis d’oideas, do ghairm bheatha, slí mhaireachtála, caitheamh aimsire etc. a chur san áireamh

source: A dispensing optician cannot prescribe prescription spectacles or contact lenses for you
ga: Ní féidir le radharceolaí dáilte spéaclaí nó lionsaí tadhaill oidis a ordú duit

source: Instead, they can only dispense and recommend spectacles and contact lenses that would be most suitable for you, given your lifestyle
ga: Ina ionad sin, ní féidir leo ach na spéaclaí agus na lionsaí tadhaill is mó d’oirfeadh duit a dháileadh agus a mholadh, agus aird ar do shlí mhaireachtála

source: Ophthalmologists are physicians who perform eye surgery and diagnose and treat eye diseases and injuries
ga: Lianna iad oftailmeolaithe a thugann faoi mháinliacht súile agus a dhéanann galair agus gortuithe súile a dhiagnóisiú

source: Ophthalmologists can also examine eyes and prescribe spectacles and contact lenses
ga: Féadfaidh optaiméadraithe scrúdú a dhéanamh ar shúile agus spéaclaí agus lionsaí tadhaill a ordú chomh maith

source: The Treatment Benefit Scheme is operated by the Department of Social Protection
ga: Scéim atá i Sochar Cóireála atá á hoibriú ag an Roinn Coimirce Sóisialaí

source: Under this scheme, you may qualify for Dental Benefit, Optical Benefit, contact lenses, and hearing aids on the basis of your PRSI contributions
ga: Faoin scéim seo, d’fhéadfá cáiliú do Shochar Fiaclóireachta, Sochar Optúil, lionsaí tadhaill agus áiseanna éisteachta ag brath ar do ranníocaíochtaí ÁSPC

source: For people with diabetes aged 12 or over, the National Diabetic Retinal Screening Programme offers free, regular screening for diabetic retinopathy, a complication of diabetes that can damage eyesight
ga: I measc daoine a bhfuil diaibéiteas orthu atá 12 bhliain d’aois nó níos sine, cuireann an Clár Náisiúnta Scagthástála Diaibéití Reitine scagthástáil saor in aisce, rialta ar tairiscint le haghaidh reitineapaite dhiaibéiteach – aimhréidh de dhiaibéiteas ar féidir léi díobháil a dhéanamh do radharc na súl

source: For more information see diabeticretinascreen.ie
ga: Chun teacht ar bhreis faisnéise, féach diabeticretinascreen.ie

source: Free optical and ophtalmic services
ga: Seirbhísí optúla agus oftalmacha saor in aisce

source: The HSE provides optical services free of charge to certain groups
ga: Tá dualgas ar Fheidhmeannacht na Seirbhíse Sláinte (FSS) seirbhísí optúla a sholáthar saor in aisce do roinnt grúpaí daoine

source: These services may be provided by HSE staff or by private practitioners
ga: Féadfaidh foireann Fheidhmeannacht na Seirbhíse Sláinte (FSS) nó cleachtóirí príobháideacha na seirbhísí seo a sholáthar

source: • Medical card holders and their dependants
ga: • Sealbhóirí cárta leighis agus a gcuid cleithiúnaithe

source: • People with Hepatitis C who contracted the disease through the use of Human Immunoglobulin-Anti-D or from receiving any blood product or a blood transfusion within Ireland and who have a Health Amendment Act Card
ga: • Daoine ar a bhfuil Heipitíteas C a rinne an galar a tholgadh trí Ghlóbailin Dhaonna Imdhíonachta Frith-D a úsáid nó trí aon táirge fola nó fuilaistriú a fháil laistigh d’Éirinn agus daoine a bhfuil Cárta faoin Acht Sláinte Leasaithe acu

source: Medical card holders are entitled to a free examination and any necessary standard spectacles once every two years (more often if required in certain medical circumstances)
ga: Tá sealbhóirí cárta leighis i dteideal tástáil saor in aisce agus aon spéaclaí caighdeánacha riachtanacha a fháil gach dhá bhliain (nó níos minice má theastaíonn iad i gcúinsí áirithe leighis)

source: All examinations and dispensing require approval from the Local Health Office
ga: Tá cead na hOifige Áitiúla Sláinte ag teastáil i gcás gach tástála agus dáilte

source: Pre-school children and national school children referred from child health service and school health service examinations who are discovered to have sight problems are referred to the appropriate consultant for treatment
ga: Déantar leanaí naíonra agus bunscoile a atreoraítear ó scrúduithe na seirbhíse sláinte leanaí agus na seirbhíse sláinte scoile a ndeimhnítear go bhfuil fadhbanna radhairc orthu, a atreorú chuig an gcomhairleach cuí le cóireáil a chur orthu

source: If this treatment is carried out at the out-patient department of a public hospital, the service is free and no hospital charges have to be paid
ga: Má thugtar faoin gcóireáil seo ag an rannóg othar seachtrach in ospidéal poiblí, bíonn an tseirbhís saor in aisce agus ní gá aon mhuirir ospidéil a íoc

source: Services in these circumstances, will continue to be provided until the child has reached the age of 16
ga: Leanfar le seirbhísí faoi na cúinsí seo, a sholáthar go dtí go mbaineann an leanbh 16 bliana d’aois amach

source: If you don't qualify for free optical services under one of the groups above, the Treatment Benefit Scheme may cover you and your dependent spouse for certain free optical services
ga: Mura bhfuil tú i measc na ngrúpaí cáilitheacha thuas, féadfaidh an Scéim Sochar Cóireála cabhrú leat agus le do cleithiúnaí céile chun roinnt seirbhísí saor in aisce optúla a fháil

source: If you do not have enough social insurance contributions, you may have to pay for these services
ga: Mura bhfuil dóthain ranníocaíochtaí árachais shóisialta agat, d’fhéadfadh go mbeadh ort íoc as na seirbhísí seo

source: You may be able to claim tax relief for medical expenses on specific optical treatments
ga: D’fhéadfadh go mbeifeá in ann faoiseamh cánach a éileamh i leith costais leighis ar chóireálacha optúla ar leith

source: These optical treatments must be prescribed by a practitioner
ga: Ní mór na cóireálacha sin bheith ordaithe ag liachleachtóir

source: Read more about taxation and medical expenses here
ga: Is féidir leat tuilleadh a léamh faoi Chánachas agus Costais Leighis anseo

source: If you have a medical card, you should apply to your Local Health Office or health centre for an eye examination
ga: Má tá cárta leighis agat, ba chóir duit iarratas a dhéanamh chuig d’Oifig Áitiúil Sláinte nó chuig ionad sláinte le haghaidh tástáil súl

source: Practising optometrists and dispensing opticians must be registered with the Opticians Board
ga: Ní mór go mbeidh optaiméadraithe agus radharceolaithe dáilte cláraithe le Bord na Radharceolaithe

source: Ophtalmologists must be registered with the Irish Medical Council
ga: Ní mór d’oftailmeolaithe bheith cláraithe le Comhairle na nDochtúirí Leighis

source: You can check that your practitioner is registered with the relevant body
ga: Féadfaidh tú a sheiceáil an bhfuil do chleachtóir cláraithe leis an gcomhlacht cuí

source: If you wish to make a complaint about a practitioner, you should contact the appropriate regulatory body
ga: Más mian leat gearán a dhéanamh faoi liachleachtóir, ba chóir duit teagmháil a dhéanamh leis an gcomhlacht rialála cuí

source: Irish Association of Dispensing Opticians Ltd
ga: An Rannóg Sochair Cóireála

source: PO Box 9013 12 Pembroke Road
ga: Bóthar Naomh Oilibhéar Pluincéad

source: The Department of Social Protection has a list of available Opticians under the Treatment Benefits Scheme
ga: Tá ag an Roinn Coimirce Sóisialaí liosta de na Radharceolaithe atá ar fáil faoin Scéim Sochar Cóireála

source: Department of Social Protection St
ga: Irish Association of Dispensing Opticians Ltd
